src/Catalogs/ПрофильМониторинга/ПрофильМониторинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрофильМониторинга</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Онлайн</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автообновление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоТочек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШагСдвига</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяНастройка</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДиаграммы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АнализПоказателейЧислоКолонок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветЗаголовкаТекущейТочки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоложениеЗаголовкаТекущейТочки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаждыйПоказательОтдельно</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйШагОбновления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОтображенияПрофиляПриРотации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПроверкиВыпоненияФоновогоЗадания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПорядокПоказателей</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтображатьНаДиаграмме</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Автомасштаб</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Масштаб</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>8</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьДанныеЗаПрошлыйПериод</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВременноеСмещение</name>
      <type>
        <types>EnumRef.ВариантыСмещенияВременногоОкна</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказыватьТренд</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУсредняемыхЗначений</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЛинии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипСглаживания</name>
      <type>
        <types>EnumRef.ТипыСглаживания</types>
      </type>
    </attributes>
    <attributes>
      <name>ТолщинаЛинии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиМониторинга</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкаПоказателя</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Быстрый</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиПоказателей</name>
    <attributes>
      <name>УИД</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыДиаграммАнализДиаграмм</name>
    <attributes>
      <name>ИдентификаторТипаПоказателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипДиаграммы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ПоказателиМониторинга/ПоказателиМониторинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПоказателиМониторинга</name>
  <owners>Catalog.ПрофильМониторинга</owners>
  <attributes>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтоМасштаб</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Масштаб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказатьДанныеЗаПрошлыйПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВременноеСмещение</name>
    <type>
      <types>EnumRef.ВариантыСмещенияВременногоОкна</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТренд</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУсредняемыхЗначений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЛинии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСглаживания</name>
    <type>
      <types>EnumRef.ТипыСглаживания</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолщинаЛинии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ЧислоНовыхОбъектов</types>
      <types>CatalogRef.ЧислоПаденийРабочихПроцессов</types>
      <types>CatalogRef.ЧислоСеансовПользователей</types>
      <types>CatalogRef.ИспользованиеОперативнойПамятиПроцессамиКластера</types>
      <types>CatalogRef.ПоказателиAPDEX</types>
      <types>CatalogRef.СкоростьРазбораПроблем</types>
      <types>CatalogRef.ТекущееЧислоВызововСервера</types>
      <types>CatalogRef.Публикации</types>
      <types>CatalogRef.ЧислоИсключенийПоТехнологическомуЖурналу</types>
      <types>CatalogRef.ОценкаПользователей</types>
      <types>CatalogRef.ПроцентДоступностиСервисаВсеБазы</types>
      <types>CatalogRef.СформированоОтчетов</types>
      <types>CatalogRef.ПоказателиСкоростиВыполненияТипичныхОпераций</types>
      <types>CatalogRef.ЧислоНерешенныхПроблем</types>
      <types>CatalogRef.ПроцентДоступностиСервисаВсеРесурсы</types>
      <types>CatalogRef.ПоказателиСчетчиков</types>
    </type>
  </attributes>
  <attributes>
    <name>Маркер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ПрофильМониторинга/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Индекс = ПроверяемыеРеквизиты.Найти("Наименование");
	Если Индекс <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(Индекс);
	КонецЕсли;
КонецПроцедуры

Функция УдалитьНастройку(НастройкаУИД) Экспорт
	Результат = Ложь;
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	Попытка
		Настройки = ЭтотОбъект.НастройкиПоказателей.НайтиСтроки(Новый Структура("УИД", НастройкаУИД));
		Для Каждого Настройка Из Настройки Цикл
			ЭтотОбъект.НастройкиПоказателей.Удалить(ЭтотОбъект.НастройкиПоказателей.Индекс(Настройка));
		КонецЦикла;
		
		Настройки = ЭтотОбъект.ПорядокПоказателей.НайтиСтроки(Новый Структура("НастройкаПоказателя", НастройкаУИД));
		Для Каждого Настройка Из Настройки Цикл
			ЭтотОбъект.ПорядокПоказателей.Удалить(ЭтотОбъект.ПорядокПоказателей.Индекс(Настройка));
		КонецЦикла;
		
		ЭтотОбъект.Записать();
		Результат = Истина;
		
		ЗафиксироватьТранзакцию();
	Исключение
		Инфо = ИнформацияОбОшибке();
		Комментарий =
			"Описание = '" +Инфо.Описание + "', " +
			"ИмяМодуля = '" + Инфо.ИмяМодуля + "', " +
			"НомерСтроки = '" + Инфо.НомерСтроки + "', " +
			"ИсходнаяСтрока = '" + Инфо.ИсходнаяСтрока + "'.";
			
		ЗаписьЖурналаРегистрации(
			"Функция УдалитьНастройку(НастройкаУИД) Экспорт",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.ПрофильМониторинга.МодульОбъекта,
			,
			Комментарий);
					
		ОтменитьТранзакцию();
		Результат = Ложь;
	КонецПопытки;
		
	Возврат Результат;
КонецФункции

Функция КопироватьПоказатели(ПрофильСсылка, НастройкаУИД, НаименованиеНастройки) Экспорт
	УИДНастройки = Новый УникальныйИдентификатор();
	
	НоваяНастройка = ЭтотОбъект.НастройкиПоказателей.Добавить();
	НоваяНастройка.УИД = УИДНастройки;
	НоваяНастройка.Наименование = НаименованиеНастройки;
	
	Показатели = Справочники.ПрофильМониторинга.ПолучитьПоказатели(ПрофильСсылка, НастройкаУИД);
	НомерПоказателя = 0;
	Для Каждого Показатель Из Показатели Цикл
		Если Показатель.Показатель = Справочники.ПоказателиМониторинга.ПустаяСсылка() Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйПоказатель = ЭтотОбъект.ПорядокПоказателей.Добавить();
		НовыйПоказатель.Номер = НомерПоказателя;
		НовыйПоказатель.ОтображатьНаДиаграмме = Показатель.ОтображатьНаДиаграмме;
		НовыйПоказатель.Автомасштаб = Показатель.Автомасштаб;
		НовыйПоказатель.Масштаб = Показатель.Масштаб;
		НовыйПоказатель.ПоказатьДанныеЗаПрошлыйПериод = Показатель.ПоказатьДанныеЗаПрошлыйПериод;
		НовыйПоказатель.ВременноеСмещение = Показатель.ВременноеСмещение;
		НовыйПоказатель.ПоказыватьТренд = Показатель.ПоказыватьТренд;
		НовыйПоказатель.КоличествоУсредняемыхЗначений = Показатель.КоличествоУсредняемыхЗначений;
		НовыйПоказатель.ТипЛинии = Показатель.ТипЛинии;
		НовыйПоказатель.ТипСглаживания = Показатель.ТипСглаживания;
		НовыйПоказатель.ТолщинаЛинии = Показатель.ТолщинаЛинии;
		
		НовыйПоказательПоказателя = Показатель.Показатель.Скопировать();
		НовыйПоказательПоказателя.Владелец = ЭтотОбъект.Ссылка;
		НовыйПоказательПоказателя.Записать();
		
		НовыйПоказатель.Показатель = НовыйПоказательПоказателя.Ссылка;
		НовыйПоказатель.НастройкаПоказателя = УИДНастройки;
	КонецЦикла;
	
	Возврат УИДНастройки;
КонецФункции

Процедура ПередЗаписью(Отказ)
	НастройкиПоказателей.Сортировать("Наименование");
КонецПроцедуры

#КонецЕсли
